blueskycoco/rt-thread/bsp/tm4c129x/applications/con_common.c
	if(phy_link)
	{
		if(level&&(flag_cnn[index]==false))
			flag_cnn[index]=true;
		else if(!level&&(flag_cnn[index]==true))
			flag_cnn[index]=false;
		else
			return;
		rt_kprintf("dev %d , level %d, phy_link %d\r\n",index,level,phy_link);
		switch(index)
		{
			case 0:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);
				else
					MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				break;
			case 1:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,GPIO_PIN_5);
				else
					MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
				break;
			case 2:
				if(level)
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,GPIO_PIN_2);
				else
					MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
				break;
			case 3:
				if(level)
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);
				else
				;//	MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
				break;
			default:
				break;
		}
	}
	else
	{
		MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,GPIO_PIN_4);	
		MAP_GPIOPinWrite(GPIO_PORTE_BASE,GPIO_PIN_5,0);	
		MAP_GPIOPinWrite(GPIO_PORTK_BASE,GPIO_PIN_2,0);	
		flag_cnn[0]=false;
		flag_cnn[1]=false;
		flag_cnn[2]=false;
		flag_cnn[3]=false;
		//MAP_GPIOPinWrite(GPIO_PORTB_BASE,GPIO_PIN_4,0);	
	}
}
int baud(int type)
{
	//rt_kprintf("input baud %d\r\n",type);
	switch(type)
	{
		case 0:
			return 115200;
		case 1:
			return 128000;
		case 2:
			return 256000;
		case 3:
			return 460800;
		case 4:
			return 921600;
		case 5:
			return 1000000;
		case 6:
			return 2000000;
		case 7:
			return 4000000;
		case 8:
			return 6000000;
		}
	return 0;
}
void print_config(config g)
{
	rt_kprintf("\n============================================================================>\r\n");
	rt_kprintf("local_ip :\t%s\r\n",g.local_ip);
	rt_kprintf("local_ip6 :\t%s\r\n",g.local_ip6);
	rt_kprintf("local_port0 :\t%d\r\n",g.local_port[0]);
	rt_kprintf("local_port1 :\t%d\r\n",g.local_port[1]);
	rt_kprintf("local_port2 :\t%d\r\n",g.local_port[2]);
	rt_kprintf("local_port3 :\t%d\r\n",g.local_port[3]);
	rt_kprintf("sub_msk :\t%s\r\n",g.sub_msk);
	rt_kprintf("gw :\t\t%s\r\n",g.gw);
	rt_kprintf("mac :\t\t%s\r\n",g.mac);
	rt_kprintf("remote_ip0 :\t%s\r\n",g.remote_ip[0]);
	rt_kprintf("remote_ip1 :\t%s\r\n",g.remote_ip[1]);
	rt_kprintf("remote_ip2 :\t%s\r\n",g.remote_ip[2]);
	rt_kprintf("remote_ip3 :\t%s\r\n",g.remote_ip[3]);
	rt_kprintf("remote_ip60 :\t%s\r\n",g.remote_ip6[0]);
	rt_kprintf("remote_ip61 :\t%s\r\n",g.remote_ip6[1]);
	rt_kprintf("remote_ip62 :\t%s\r\n",g.remote_ip6[2]);
	rt_kprintf("remote_ip63 :\t%s\r\n",g.remote_ip6[3]);
	rt_kprintf("remote_port0 :\t%d\r\n",g.remote_port[0]);
	rt_kprintf("remote_port1 :\t%d\r\n",g.remote_port[1]);
	rt_kprintf("remote_port2 :\t%d\r\n",g.remote_port[2]);
	rt_kprintf("remote_port3 :\t%d\r\n",g.remote_port[3]);
	rt_kprintf("IP==>\tv4_v6\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x01)==0)?"IPV4":"IPV6",((g.config[1]&0x01)==0)?"IPV4":"IPV6",((g.config[2]&0x01)==0)?"IPV4":"IPV6",((g.config[3]&0x01)==0)?"IPV4":"IPV6");
	rt_kprintf("protol==>\tudp_tcp\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x02)==0x02)?"TCP":"UDP",((g.config[1]&0x02)==0x02)?"TCP":"UDP",((g.config[2]&0x02)==0x02)?"TCP":"UDP",((g.config[3]&0x02)==0x02)?"TCP":"UDP");
	rt_kprintf("mode==>\tclient_server\r\nsocket0 :\t%s\r\nsocket1 :\t%s\r\nsocket2 :\t%s\r\nsocket3 :\t%s\r\n",((g.config[0]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[1]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[2]&0x04)==0x04)?"SERVER":"CLIENT",((g.config[3]&0x04)==0x04)?"SERVER":"CLIENT");
	rt_kprintf("baud :\t\t%d.%d.%d.%d\r\n",baud((g.config[0]&0xf8)>>3),baud((g.config[1]&0xf8)>>3),baud((g.config[2]&0xf8)>>3),baud((g.config[3]&0xf8)>>3));
	rt_kprintf("\n============================================================================>\r\n");
}
int common_w_socket(int dev)
{	
	int len;
	rt_uint8_t /*common_buf[2048],*/*ptr;
	if(phy_link&&g_socket[dev].connected)
	{
		ptr=rt_malloc(256);
		len=rt_device_read(common_dev[dev], 0, ptr, 256);
		if(phy_link&&(len>0)&&g_socket[dev].connected)
		{
			rt_data_queue_push(&g_data_queue[dev*2], ptr, len, RT_WAITING_FOREVER);	
		}
		else
			rt_free(ptr);
	}
	return 0;
}
static rt_err_t common_rx_ind(rt_device_t dev, rt_size_t size)
{
    /* release semaphore to let finsh thread rx data */
	//DBG("dev %d common_rx_ind %d\r\n",which_common_dev(common_dev,dev),size);
    rt_sem_release(&(rx_sem[which_common_dev(common_dev,dev)]));
    return RT_EOK;
}

void common_w(void* parameter)
{
	int dev=((int)parameter)/2;
	static int flag[4]={0,0,0,0};
	DBG("common_w %d Enter\r\n",dev);
	while (1)
	{
		/* wait receive */
		if (rt_sem_take(&(rx_sem[dev]), RT_WAITING_FOREVER) != RT_EOK) continue;
		//DBG("to read in_low %d\r\n",ind_low(dev));
		if(ind[dev])
		{	
			//DBG("dev %d in socket data flag %d\n",dev,flag);
			if(flag[dev]==1)
			{
				print_config(g_conf);
				flag[dev]=0;	
				void *ptr1=(void *)&g_confb;
				void *ptr2=(void *)&g_conf;
				if(rt_memcmp(ptr1,ptr2,sizeof(config))!=0)
				{
					print_config(g_conf);
				}
			}
			
			/*socket data transfer,use dma*/			
			common_w_socket(dev);
			
		}
		else
		{
			DBG("dev %d in config data flag %d\r\n",dev,flag[dev]);
			if(flag[dev]==0)
			{
				flag[dev]=1;
				void *ptr1=(void *)&g_confb;
				void *ptr2=(void *)&g_conf;
				rt_memcpy(ptr1,ptr2,sizeof(config));
			}
			common_rw_config(dev);
		}
	}
}
void common_w_usb(void* parameter)
{
	int dev=((int)parameter)/2;
	rt_kprintf("common_w_usb %d\r\n",dev);
	while(1)
	{
		//if (rt_sem_take(&(rx_sem[dev]), RT_WAITING_FOREVER) != RT_EOK) continue;
		_usb_read(dev);
	}
	
}
void common_w_epi(void* parameter)
{
	int dev=((int)parameter)/2;
	rt_kprintf("common_w_epi %d\r\n",dev);
	while(1)
	{
		if (rt_sem_take(&(rx_sem[0]), RT_WAITING_FOREVER) != RT_EOK) continue;
		_epi_read();
	}	
}

static void common_r(void* parameter)
{
    rt_size_t data_size;
    const void *last_data_ptr=RT_NULL;
	void *data_ptr;
	int dev=(int)parameter;
	rt_err_t r=RT_EFULL;	
    rt_kprintf("common_r %d Enter\r\n",(dev-1)/2);
	while(1)
	{
		r=rt_data_queue_pop(&g_data_queue[dev], &last_data_ptr, &data_size, RT_WAITING_FOREVER);
		if(r==RT_EOK && data_size!=0 && last_data_ptr)
		{
			if(g_dev==1)
			{
				_usb_write(1,(void *)last_data_ptr,data_size);
			}
			else if(g_dev==2)
			{
				_epi_write((dev-1)/2,last_data_ptr,data_size,0x04+(dev-1)/2);
			}
			else
				rt_device_write(common_dev[(dev-1)/2], 0, last_data_ptr, data_size);
			if(last_data_ptr)
			{
				rt_free((void *)last_data_ptr);
				last_data_ptr=RT_NULL;
			}
		}
	}
}
void bus_speed_test(void *param)
{
	rt_uint8_t config_ip[]={0xF5,0x8A,0x00,0xc0,0xa8,0x01,0x67,0x26,0xfa,0x00,0x00};
	char buf[1022]={0};
	long times=102601;
	long i=0;
	memset(buf,0x38,1022);
	for(i=33;i<127;i++)
		buf[i-33]=i;
	for(i=1;i<11;i++)
	memcpy(buf+93*i+1,buf,93);
	memcpy(buf+931,buf,91);
	while(start_bus_speed==0)
		rt_thread_delay(1);
	rt_kprintf("start bus speed test\n");
	rt_hw_led_on();
	for(i=0;i<times;i++)
		_epi_write(0,buf,1022,0);
	rt_hw_led_off();
	rt_kprintf("end test\n");
	config_ip[6]=config_ip[6]+1;
	_epi_send_config(config_ip,sizeof(config_ip));
}
/*init common1,2,3,4 for 4 socket*/
int common_init(int dev)//0 uart , 1 parallel bus, 2 usb
{
	/*init common device*/
	rt_err_t result;
	rt_uint8_t common[10];
	int i,max_devices=4;
	/*read config data from internal flash*/
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
	MAP_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);

